{
    "www.eke-electronics.com": {
        "url": "http://www.eke-electronics.com",
        "mainBusinessLine": "Manufacture of electronic components",
        "pages": [
            {
                "page_url": "http://www.eke-electronics.com",
                "content": "Skip to contentCompanyNews and eventsDownloadCompanyNews and eventsDownload Search Products and solutionsEKE-TRAINNET TRAIN CONTROL AND MANAGEMENT SYSTEMS (TCMS)Vehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformVehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformEKE-TRAINNET SAFETY APPLICATIONSAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSMARTVISION CONDITION BASED MONITORING (CBM)Track Condition MonitoringTrain Condition MonitoringTrack Condition MonitoringTrain Condition MonitoringServices and supportCustomer careproject managementReferencesCareerContact EKE-ElectronicsFor almost four decades, EKE-Electronics has been a proud supplier of Train Control and Management System solutions to train manufacturers, operators, and integrators around the world. We provide tailored solutions for system integration, train automation, train communications, train diagnostics, and improved safety. Talk to us about your projects Train Control & Management SystemEKE-Trainnet train control and management system exemplifies dependability in railway operations. With a steadfast focus on safety and efficiency, our solutions ensure enduring reliability for railway operations worldwide. Read more about EKE-Trainnet SIL Safety ApplicationsAt EKE-Electronics, we excel in developing SIL 2 systems across diverse safety functions, following strict standards like EN50126/50128/50129. With our proven track record and rigorous practices, we deliver unmatched reliability in safety-critical solutions. Read more about Safety Applications Condition-Based MonitoringSmartVision is EKE-Electronics’ condition-based and predictive maintenance platform, allowing convenient fleet health monitoring via a browser-based interface. Our Monitoring as a Service feature enables automated fleet monitoring regardless of train manufacturers. Read more about SmartVision What Has EKE Achieved?We work with some of the biggest train builders and operators earning the trust and loyalty of our returning customers. There are over 35,000 EKE systems in operation around the world, serving our customers with unparalleled safety, performance and cost-effectiveness.Continents 0 Countries 0 Trains 0 Systems 0 Who Does EKE Work With? How Does EKE Work?We offer a flexible business model tailored to each customer’s unique capabilities and resources. Our customised solutions provide the optimal balance of support and independence for train projects. Turnkey ProjectsWe are responsible for the complete architecture design, software implementation, and commissioning of the first trainset. Delivery ProjectsStandard EKE-Trainnet platform, enabling independent configuration and programming of application software using our development environment powered by CODESYS®. Solution ProjectsSpecific solutions and applications are delivered to customers to solve a particular problem or challenge, meeting requirements specified by the market or the customers. Find out how we can work together Contact us Smarter trains. Better future. Contact us Linkedin-in Youtube Privacy Policy | Cookie Policy | Disclaimer | Imprint | Hosting by Sivustamo Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage Cookie Consent Parhaan kokemuksen tarjoamiseksi käytämme teknologioita, kuten evästeitä, tallentaaksemme ja/tai käyttääksemme laitetietoja. Näiden tekniikoiden hyväksyminen antaa meille mahdollisuuden käsitellä tietoja, kuten selauskäyttäytymistä tai yksilöllisiä tunnuksia tällä sivustolla. Suostumuksen jättäminen tai peruuttaminen voi vaikuttaa haitallisesti tiettyihin ominaisuuksiin ja toimintoihin. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage consentManage consent Search Search Products and solutionsEKE-Trainnet® Train Control and Management Systems (TMCS)Vehicle Control UnitTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesSolution Delivery CapabilitiesPLC application programming platformEKE-Trainnet® Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSmartVision™Track Condition MonitoringTrain Condition MonitoringServices and supportCustomer careProject managementReferencesCareerContactCompanyNews and eventsDownloads Search Search"
            },
            {
                "page_url": "http://www.eke-electronics.com#content",
                "content": "Skip to contentCompanyNews and eventsDownloadCompanyNews and eventsDownload Search Products and solutionsEKE-TRAINNET TRAIN CONTROL AND MANAGEMENT SYSTEMS (TCMS)Vehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformVehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformEKE-TRAINNET SAFETY APPLICATIONSAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSMARTVISION CONDITION BASED MONITORING (CBM)Track Condition MonitoringTrain Condition MonitoringTrack Condition MonitoringTrain Condition MonitoringServices and supportCustomer careproject managementReferencesCareerContact EKE-ElectronicsFor almost four decades, EKE-Electronics has been a proud supplier of Train Control and Management System solutions to train manufacturers, operators, and integrators around the world. We provide tailored solutions for system integration, train automation, train communications, train diagnostics, and improved safety. Talk to us about your projects Train Control & Management SystemEKE-Trainnet train control and management system exemplifies dependability in railway operations. With a steadfast focus on safety and efficiency, our solutions ensure enduring reliability for railway operations worldwide. Read more about EKE-Trainnet SIL Safety ApplicationsAt EKE-Electronics, we excel in developing SIL 2 systems across diverse safety functions, following strict standards like EN50126/50128/50129. With our proven track record and rigorous practices, we deliver unmatched reliability in safety-critical solutions. Read more about Safety Applications Condition-Based MonitoringSmartVision is EKE-Electronics’ condition-based and predictive maintenance platform, allowing convenient fleet health monitoring via a browser-based interface. Our Monitoring as a Service feature enables automated fleet monitoring regardless of train manufacturers. Read more about SmartVision What Has EKE Achieved?We work with some of the biggest train builders and operators earning the trust and loyalty of our returning customers. There are over 35,000 EKE systems in operation around the world, serving our customers with unparalleled safety, performance and cost-effectiveness.Continents 0 Countries 0 Trains 0 Systems 0 Who Does EKE Work With? How Does EKE Work?We offer a flexible business model tailored to each customer’s unique capabilities and resources. Our customised solutions provide the optimal balance of support and independence for train projects. Turnkey ProjectsWe are responsible for the complete architecture design, software implementation, and commissioning of the first trainset. Delivery ProjectsStandard EKE-Trainnet platform, enabling independent configuration and programming of application software using our development environment powered by CODESYS®. Solution ProjectsSpecific solutions and applications are delivered to customers to solve a particular problem or challenge, meeting requirements specified by the market or the customers. Find out how we can work together Contact us Smarter trains. Better future. Contact us Linkedin-in Youtube Privacy Policy | Cookie Policy | Disclaimer | Imprint | Hosting by Sivustamo Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage Cookie Consent Parhaan kokemuksen tarjoamiseksi käytämme teknologioita, kuten evästeitä, tallentaaksemme ja/tai käyttääksemme laitetietoja. Näiden tekniikoiden hyväksyminen antaa meille mahdollisuuden käsitellä tietoja, kuten selauskäyttäytymistä tai yksilöllisiä tunnuksia tällä sivustolla. Suostumuksen jättäminen tai peruuttaminen voi vaikuttaa haitallisesti tiettyihin ominaisuuksiin ja toimintoihin. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage consentManage consent Search Search Products and solutionsEKE-Trainnet® Train Control and Management Systems (TMCS)Vehicle Control UnitTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesSolution Delivery CapabilitiesPLC application programming platformEKE-Trainnet® Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSmartVision™Track Condition MonitoringTrain Condition MonitoringServices and supportCustomer careProject managementReferencesCareerContactCompanyNews and eventsDownloads Search Search"
            },
            {
                "page_url": "https://www.eke-electronics.com/company/",
                "content": "Skip to contentCompanyNews and eventsDownloadCompanyNews and eventsDownload Search Products and solutionsEKE-TRAINNET TRAIN CONTROL AND MANAGEMENT SYSTEMS (TCMS)Vehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformVehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformEKE-TRAINNET SAFETY APPLICATIONSAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSMARTVISION CONDITION BASED MONITORING (CBM)Track Condition MonitoringTrain Condition MonitoringTrack Condition MonitoringTrain Condition MonitoringServices and supportCustomer careproject managementReferencesCareerContact CompanyWe provide leading technologies to train manufacturers, operators and integrators for efficient train manufacturing and operations. Our versatile offering includes tailored solutions for system integration, train automation, train communications, train diagnostics and improved safety. About usEKE-Electronics Ltd is the leading provider of Train Control and Management System (TCMS) and Condition Based Monitoring (CBM) with turnkey project management and safety control systems. The EKE-Trainnet® platform includes solutions for system integration, automation, communications, diagnostics and improved safety. We develop functional safety solutions (SIL) to meet your requirements and to make your train control and management systems safer and more reliable.SmartVision™ is an advanced system for remotely monitoring the health of trains, their subsystems and track infrastructure. It provides a complete condition monitoring solution enabling the implementation of condition-based maintenance.We offer solutions and technologies to rolling stock manufacturers, train operating companies, system integrators and rail fleet maintenance companies as well as to infra owners and fleet and infra maintainers. Our solutions ensure efficient train manufacturing, operations, and condition-based monitoring. Our solutions are designed to fit all kinds of trains: high-speed trains, commuter trains, metros, trams, passenger coaches and locomotives.Our expertise includesTrain Control and Management Systems (TCMS)Train Communication Networks (TCN)Vehicle Control Units (VCU)Gateways (MVB, WTB, CAN, Serial Links, Ethernet) Event RecordersRemote Condition Monitoring Systems Wireless communication capabilitiesTurn-key project management and engineering servicesThe proven record shows that EKE-Electronics has delivered tens of thousands of systems around the world. We are continuously developing systems and applications to continue serving our customers with the highest quality and reliability. EKE-Electronics is IRIS certified and our products comply with the railway industry standards such as EN 50155. Read more about our references Our MissionWe strive for customer loyalty by providing world-class products and services and act responsively for our current and new key customers globally. Our products and services are innovative and exceed the market requirements. We are a profitable and sustainable growing company, and we improve our profitability through efficient operational processes. We attract and retain people by providing interesting work with opportunities to grow. Our VisionEKE is the most preferred and trusted partner in providing Train Communication and Management System and Services in selected global markets.Professional and international teamwork at EKETeamwork at EKE is vital to its success and is conducted in a multicultural and international environment. Our professional team has grown fast in recent years, and now it consists of around 100 people. We are operating from our Headquarters in Espoo.EKE-Electronics provides state-of-the-art electronics and automation solutions for the railway industry worldwide. To maintain its competitive edge, we rely on world-class processes, modern technologies, agile development methods, and highly skilled professionals. Whether you work in Engineering, Software Development, or Project Management, EKE provides a great environment to develop as a professional and person.We attract and retain people by providing interesting work with opportunities to growWorking at EKE-Electronics you can see your work being used around the world. There are few more gratifying feeling than travelling to distant locations such as in Europe, Australia or South America and riding on a train that you helped run smoothly and safely. Commitment from shareholders EKE-Electronics is a privately owned company, with strong roots in the family-owned EKE Group. The shareholders are committed to the long-term development of EKE-Electronics, to retain employees and protect internal know-how. As an example, most of the EKE-Electronics employees have been working for the group for more than ten years and consequently have gained incomparable knowledge and experience.Mitsubishi Electric became the minority shareholder of EKE-Electronics in 2020.Mitsubishi Electric and EKE Group share a joint commitment to creating technological excellence and sustainable long-term growth. This partnership offers a wider portfolio, more comprehensive solutions and projects for all customer segments.The story behind EKE-Electronics 1961Foundation of the EKE Group in Finland 1961 1986EKE-Electronics founded 1986 1987The first EKE-Trainnet® railway compliant gateways are developed 1987 1990First international projects with the London Underground Central Line (TMS system) 1990 1996First IEC 61375 standardized TCN gateway developed 1996 2005ISO 9001 Certification 2005 2007First fully Ethernet-based TCMS worldwide delivered 2007 2010First IRIS Rev.02 Certification 2010 2013First SIL 2 certifications for EKE systems 2013 2016Largest order to date from London Underground for DTS and PIS systems 2016 2018Downer-CRRC High Capacity Trains Melbourne project 2018 2019Acquisition of Humaware 2019 2019Cooperation agreement with VR FleetCare for development of bogie and track condition monitoring 2019 2020Mitsubishi Electric Corporation as co-owner of EKE-Electronics Ltd. 2020 2022EKE contributes to the safety of the rail traffic by developing and delivering new safety critical (SIL 2) functions and applications during 2022 2022 Contact us Smarter trains. Better future. Contact us Linkedin-in Youtube Privacy Policy | Cookie Policy | Disclaimer | Imprint | Hosting by Sivustamo Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage Cookie Consent Parhaan kokemuksen tarjoamiseksi käytämme teknologioita, kuten evästeitä, tallentaaksemme ja/tai käyttääksemme laitetietoja. Näiden tekniikoiden hyväksyminen antaa meille mahdollisuuden käsitellä tietoja, kuten selauskäyttäytymistä tai yksilöllisiä tunnuksia tällä sivustolla. Suostumuksen jättäminen tai peruuttaminen voi vaikuttaa haitallisesti tiettyihin ominaisuuksiin ja toimintoihin. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage consentManage consent Search Search Products and solutionsEKE-Trainnet® Train Control and Management Systems (TMCS)Vehicle Control UnitTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesSolution Delivery CapabilitiesPLC application programming platformEKE-Trainnet® Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSmartVision™Track Condition MonitoringTrain Condition MonitoringServices and supportCustomer careProject managementReferencesCareerContactCompanyNews and eventsDownloads Search Search"
            },
            {
                "page_url": "https://www.eke-electronics.com/news-and-events/",
                "content": "Skip to contentCompanyNews and eventsDownloadCompanyNews and eventsDownload Search Products and solutionsEKE-TRAINNET TRAIN CONTROL AND MANAGEMENT SYSTEMS (TCMS)Vehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformVehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformEKE-TRAINNET SAFETY APPLICATIONSAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSMARTVISION CONDITION BASED MONITORING (CBM)Track Condition MonitoringTrain Condition MonitoringTrack Condition MonitoringTrain Condition MonitoringServices and supportCustomer careproject managementReferencesCareerContact News and eventsYour source for the latest Train Control and Management and Condition Based Monitoring related news and eventsFollow us also on LinkedIn and YoutubeLatest news Modbus TCP update Today, EKE-Electronics are announcing the rollout of Modbus TCP (Transmission Control Protocol) client capabilities to our CODESYS® implementation, to further boost the interoperability of our TCMS systems. Read More 20.3.2024 More news Upcoming events EKE at InnoTrans 2024 We are excitedly anticipating the opportunity to showcase our comprehensive product portfolio, demonstrating why EKE-Electronics is the ideal partner for your train automation, system integration, onboard communications, and safety applications. In addition, our SmartVision Track and Train Condition Monitoring solutions will be demonstrated. Event Details 24th – 27th September 2024. Read More 4.6.2024 EKE goes to Rolling Stock Networking Event (RSN) We are excited to share that we will be participating in the upcoming Rolling Stock Networking Event! This event will offer us a great chance to connect with key players in the industry, present our latest advancements, and foster partnerships within the rolling stock sector. Event details: Date: 4.7.2024 Time: Read More 12.3.2024 More events All news and blog postsAll6Blog postNews Blog post Implementing the ATTITUDE Methodology for Track Condition MonitoringThe ATTITUDE methodology, a revolutionary approach that combines data acquisition, continuous measurement, trend analysis, and prioritised maintenance for track condition monitoring22.4.2024 News Modbus TCP updateToday, EKE-Electronics are announcing the rollout of Modbus TCP (Transmission Control Protocol) client capabilities to our CODESYS® implementation, to further boost the interoperability of our TCMS systems.20.3.2024 Blog post Mastering the Art of Developing Condition Indicators for Track Condition MonitoringIntroduction In the realm of predictive maintenance and reliability engineering, condition indicators play a pivotal role in assessing the health of track infrastructure. Vibration signals, collected from the wheels of the train as they travel along the track, emerge as a symphony of information, offering a unique insight into...18.3.2024 News Japanese emperor’s birthday celebration reception in 2024On March 7th, EKE-Electronics had the privilege of participating in a birthday celebration reception for His Majesty the Emperor of Japan. The event took place at the Embassy of Japan in Finland and was graciously hosted by Ambassador Takashi Okada. Among the esteemed guests were prominent figures from both...14.3.2024 EventsNews EKE goes to Rolling Stock Networking Event (RSN)We are excited to share that we will be participating in the upcoming Rolling Stock Networking Event! This event will offer us a great chance to connect with key players in the industry, present our latest advancements, and foster partnerships within the rolling stock sector. Event details: Date: 4.7.2024...12.3.2024 Blog post Track Condition Monitoring Trends 2024Our industry experts Karl Lönngren and Bernadette Culkin unveil their five trends in track condition monitoring for 2024. An in-depth exploration of each trend is presented in the document below.12.1.2024Show more Contact us Smarter trains. Better future. Contact us Linkedin-in Youtube Privacy Policy | Cookie Policy | Disclaimer | Imprint | Hosting by Sivustamo Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage Cookie Consent Parhaan kokemuksen tarjoamiseksi käytämme teknologioita, kuten evästeitä, tallentaaksemme ja/tai käyttääksemme laitetietoja. Näiden tekniikoiden hyväksyminen antaa meille mahdollisuuden käsitellä tietoja, kuten selauskäyttäytymistä tai yksilöllisiä tunnuksia tällä sivustolla. Suostumuksen jättäminen tai peruuttaminen voi vaikuttaa haitallisesti tiettyihin ominaisuuksiin ja toimintoihin. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage consentManage consent Search Search Products and solutionsEKE-Trainnet® Train Control and Management Systems (TMCS)Vehicle Control UnitTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesSolution Delivery CapabilitiesPLC application programming platformEKE-Trainnet® Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSmartVision™Track Condition MonitoringTrain Condition MonitoringServices and supportCustomer careProject managementReferencesCareerContactCompanyNews and eventsDownloads Search Search"
            },
            {
                "page_url": "https://www.eke-electronics.com/downloads/",
                "content": "Skip to contentCompanyNews and eventsDownloadCompanyNews and eventsDownload Search Products and solutionsEKE-TRAINNET TRAIN CONTROL AND MANAGEMENT SYSTEMS (TCMS)Vehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformVehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformEKE-TRAINNET SAFETY APPLICATIONSAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSMARTVISION CONDITION BASED MONITORING (CBM)Track Condition MonitoringTrain Condition MonitoringTrack Condition MonitoringTrain Condition MonitoringServices and supportCustomer careproject managementReferencesCareerContact DownloadWelcome to our Download section, where you can easily access a range of essential documents to learn more about our products and services. Here, you’ll find detailed product family brochures, technical specifications, certificates, and our terms and conditions.BrochuresExplore and download our comprehensive brochures to learn more about EKE-Electronics’ solutions for Train Control and Managment Systems (TCMS), SIL Safety Applications and Condition-Based Monitoring. Our brochures provide detailed information on products and services. Whether you’re looking for technical specifications or an overview of our technology, our brochures, our brochures are just a click away. Download now to stay informed.About EKE About EKE TCMS Product Family EKE-Trainnet® Train Control and Management Systems SIL Safety Product Family EKE-Trainnet® SIL Safety Applications SmartVision Product Family SmartVision™ Condition-Based Monitoring Train Modernisation Train Modernistaion and Refurbishment Technical Specification EKE-Trainnet® Technical Specifications CertificatesEKE-Electronics is committed to maintaining the highest standards in quality and safety. Download our official certifications to learn more about our dedication to excellence in railway technology and management systems. These certifications highlight our compliance with global industry standards. IRIS Certificate ISO 9001 Certificate EU Declaration of ConformityDownload our EU Declaration of Conformity certificates. WGM4147B OMG3658A Terms and ConditionsAccess EKE-Electronics’ official Terms and Conditions to understand the terms governing our products, services, and business transactions. General Terms and Conditions of Sale Contact us Smarter trains. Better future. Contact us Linkedin-in Youtube Privacy Policy | Cookie Policy | Disclaimer | Imprint | Hosting by Sivustamo Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage Cookie Consent Parhaan kokemuksen tarjoamiseksi käytämme teknologioita, kuten evästeitä, tallentaaksemme ja/tai käyttääksemme laitetietoja. Näiden tekniikoiden hyväksyminen antaa meille mahdollisuuden käsitellä tietoja, kuten selauskäyttäytymistä tai yksilöllisiä tunnuksia tällä sivustolla. Suostumuksen jättäminen tai peruuttaminen voi vaikuttaa haitallisesti tiettyihin ominaisuuksiin ja toimintoihin. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage consentManage consent Search Search Products and solutionsEKE-Trainnet® Train Control and Management Systems (TMCS)Vehicle Control UnitTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesSolution Delivery CapabilitiesPLC application programming platformEKE-Trainnet® Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSmartVision™Track Condition MonitoringTrain Condition MonitoringServices and supportCustomer careProject managementReferencesCareerContactCompanyNews and eventsDownloads Search Search"
            },
            {
                "page_url": "http://www.eke-electronics.com#elementor-action%3Aaction%3Dpopup%3Aopen%26settings%3DeyJpZCI6IjIxMSIsInRvZ2dsZSI6ZmFsc2V9",
                "content": "Skip to contentCompanyNews and eventsDownloadCompanyNews and eventsDownload Search Products and solutionsEKE-TRAINNET TRAIN CONTROL AND MANAGEMENT SYSTEMS (TCMS)Vehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformVehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformEKE-TRAINNET SAFETY APPLICATIONSAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSMARTVISION CONDITION BASED MONITORING (CBM)Track Condition MonitoringTrain Condition MonitoringTrack Condition MonitoringTrain Condition MonitoringServices and supportCustomer careproject managementReferencesCareerContact EKE-ElectronicsFor almost four decades, EKE-Electronics has been a proud supplier of Train Control and Management System solutions to train manufacturers, operators, and integrators around the world. We provide tailored solutions for system integration, train automation, train communications, train diagnostics, and improved safety. Talk to us about your projects Train Control & Management SystemEKE-Trainnet train control and management system exemplifies dependability in railway operations. With a steadfast focus on safety and efficiency, our solutions ensure enduring reliability for railway operations worldwide. Read more about EKE-Trainnet SIL Safety ApplicationsAt EKE-Electronics, we excel in developing SIL 2 systems across diverse safety functions, following strict standards like EN50126/50128/50129. With our proven track record and rigorous practices, we deliver unmatched reliability in safety-critical solutions. Read more about Safety Applications Condition-Based MonitoringSmartVision is EKE-Electronics’ condition-based and predictive maintenance platform, allowing convenient fleet health monitoring via a browser-based interface. Our Monitoring as a Service feature enables automated fleet monitoring regardless of train manufacturers. Read more about SmartVision What Has EKE Achieved?We work with some of the biggest train builders and operators earning the trust and loyalty of our returning customers. There are over 35,000 EKE systems in operation around the world, serving our customers with unparalleled safety, performance and cost-effectiveness.Continents 0 Countries 0 Trains 0 Systems 0 Who Does EKE Work With? How Does EKE Work?We offer a flexible business model tailored to each customer’s unique capabilities and resources. Our customised solutions provide the optimal balance of support and independence for train projects. Turnkey ProjectsWe are responsible for the complete architecture design, software implementation, and commissioning of the first trainset. Delivery ProjectsStandard EKE-Trainnet platform, enabling independent configuration and programming of application software using our development environment powered by CODESYS®. Solution ProjectsSpecific solutions and applications are delivered to customers to solve a particular problem or challenge, meeting requirements specified by the market or the customers. Find out how we can work together Contact us Smarter trains. Better future. Contact us Linkedin-in Youtube Privacy Policy | Cookie Policy | Disclaimer | Imprint | Hosting by Sivustamo Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage Cookie Consent Parhaan kokemuksen tarjoamiseksi käytämme teknologioita, kuten evästeitä, tallentaaksemme ja/tai käyttääksemme laitetietoja. Näiden tekniikoiden hyväksyminen antaa meille mahdollisuuden käsitellä tietoja, kuten selauskäyttäytymistä tai yksilöllisiä tunnuksia tällä sivustolla. Suostumuksen jättäminen tai peruuttaminen voi vaikuttaa haitallisesti tiettyihin ominaisuuksiin ja toimintoihin. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage consentManage consent Search Search Products and solutionsEKE-Trainnet® Train Control and Management Systems (TMCS)Vehicle Control UnitTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesSolution Delivery CapabilitiesPLC application programming platformEKE-Trainnet® Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSmartVision™Track Condition MonitoringTrain Condition MonitoringServices and supportCustomer careProject managementReferencesCareerContactCompanyNews and eventsDownloads Search Search"
            },
            {
                "page_url": "https://www.eke-electronics.com",
                "content": "Skip to contentCompanyNews and eventsDownloadCompanyNews and eventsDownload Search Products and solutionsEKE-TRAINNET TRAIN CONTROL AND MANAGEMENT SYSTEMS (TCMS)Vehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformVehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformEKE-TRAINNET SAFETY APPLICATIONSAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSMARTVISION CONDITION BASED MONITORING (CBM)Track Condition MonitoringTrain Condition MonitoringTrack Condition MonitoringTrain Condition MonitoringServices and supportCustomer careproject managementReferencesCareerContact EKE-ElectronicsFor almost four decades, EKE-Electronics has been a proud supplier of Train Control and Management System solutions to train manufacturers, operators, and integrators around the world. We provide tailored solutions for system integration, train automation, train communications, train diagnostics, and improved safety. Talk to us about your projects Train Control & Management SystemEKE-Trainnet train control and management system exemplifies dependability in railway operations. With a steadfast focus on safety and efficiency, our solutions ensure enduring reliability for railway operations worldwide. Read more about EKE-Trainnet SIL Safety ApplicationsAt EKE-Electronics, we excel in developing SIL 2 systems across diverse safety functions, following strict standards like EN50126/50128/50129. With our proven track record and rigorous practices, we deliver unmatched reliability in safety-critical solutions. Read more about Safety Applications Condition-Based MonitoringSmartVision is EKE-Electronics’ condition-based and predictive maintenance platform, allowing convenient fleet health monitoring via a browser-based interface. Our Monitoring as a Service feature enables automated fleet monitoring regardless of train manufacturers. Read more about SmartVision What Has EKE Achieved?We work with some of the biggest train builders and operators earning the trust and loyalty of our returning customers. There are over 35,000 EKE systems in operation around the world, serving our customers with unparalleled safety, performance and cost-effectiveness.Continents 0 Countries 0 Trains 0 Systems 0 Who Does EKE Work With? How Does EKE Work?We offer a flexible business model tailored to each customer’s unique capabilities and resources. Our customised solutions provide the optimal balance of support and independence for train projects. Turnkey ProjectsWe are responsible for the complete architecture design, software implementation, and commissioning of the first trainset. Delivery ProjectsStandard EKE-Trainnet platform, enabling independent configuration and programming of application software using our development environment powered by CODESYS®. Solution ProjectsSpecific solutions and applications are delivered to customers to solve a particular problem or challenge, meeting requirements specified by the market or the customers. Find out how we can work together Contact us Smarter trains. Better future. Contact us Linkedin-in Youtube Privacy Policy | Cookie Policy | Disclaimer | Imprint | Hosting by Sivustamo Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage Cookie Consent Parhaan kokemuksen tarjoamiseksi käytämme teknologioita, kuten evästeitä, tallentaaksemme ja/tai käyttääksemme laitetietoja. Näiden tekniikoiden hyväksyminen antaa meille mahdollisuuden käsitellä tietoja, kuten selauskäyttäytymistä tai yksilöllisiä tunnuksia tällä sivustolla. Suostumuksen jättäminen tai peruuttaminen voi vaikuttaa haitallisesti tiettyihin ominaisuuksiin ja toimintoihin. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage consentManage consent Search Search Products and solutionsEKE-Trainnet® Train Control and Management Systems (TMCS)Vehicle Control UnitTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesSolution Delivery CapabilitiesPLC application programming platformEKE-Trainnet® Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSmartVision™Track Condition MonitoringTrain Condition MonitoringServices and supportCustomer careProject managementReferencesCareerContactCompanyNews and eventsDownloads Search Search"
            },
            {
                "page_url": "https://www.eke-electronics.com/products-and-solutions/",
                "content": "Skip to contentCompanyNews and eventsDownloadCompanyNews and eventsDownload Search Products and solutionsEKE-TRAINNET TRAIN CONTROL AND MANAGEMENT SYSTEMS (TCMS)Vehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformVehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformEKE-TRAINNET SAFETY APPLICATIONSAutomatic Selective Door OperationHot Axle Box DetectionCorrect Side Door EnablingLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsAutomatic Selective Door OperationHot Axle Box DetectionCorrect Side Door EnablingLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSMARTVISION CONDITION BASED MONITORING (CBM)Track Condition MonitoringTrain Condition MonitoringTrack Condition MonitoringTrain Condition MonitoringServices and supportCustomer careproject managementReferencesCareerContact Products and solutionsExtensive portfolio of products and solutions for your TCMS needs including performance, flexibility and cost-efficiency. EKE-Trainnet TRAIN CONTROL AND MANAGEMENT SYSTEMS (TCMS)Our EKE-Trainnet Train Control and Management System (TCMS) is a versatile platform that includes solutions for train automation, train communications, train diagnostics, train system integration and improved safety. We develop functional safety solutions (SIL) to meet your requirements and to make your train control and management systems safer and more reliable. Read more about EKE-Trainnet Safety Applications EKE-TRAINNETSafety Integrity Level (SIL) is an indicator of the relative risk-reduction provided by a safety function. EKE-Electronics helps you develop SIL functions to make your trains | trams | metros safer and more reliable. Read more about Safety Applications SmartVision CONDITION BASED MONITORING (CBM)SmartVision™ is an advanced system for remotely monitoring the health of trains, their subsystems and track infrastructure. It provides a complete condition monitoring solution enabling the implementation of condition-based maintenance. Read more about SmartVision Videos Show more videos The modularity of EKE-Trainnet products and solutions provides you with the optimal performance for all your TCMS needs, and the flexibility to grow and update your system in a cost-efficient way. Contact us Smarter trains. Better future. Contact us Linkedin-in Youtube Privacy Policy | Cookie Policy | Disclaimer | Imprint | Hosting by Sivustamo Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage Cookie Consent Parhaan kokemuksen tarjoamiseksi käytämme teknologioita, kuten evästeitä, tallentaaksemme ja/tai käyttääksemme laitetietoja. Näiden tekniikoiden hyväksyminen antaa meille mahdollisuuden käsitellä tietoja, kuten selauskäyttäytymistä tai yksilöllisiä tunnuksia tällä sivustolla. Suostumuksen jättäminen tai peruuttaminen voi vaikuttaa haitallisesti tiettyihin ominaisuuksiin ja toimintoihin. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage consentManage consent Search Search Products and solutionsEKE-Trainnet® Train Control and Management Systems (TMCS)Vehicle Control UnitTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesSolution Delivery CapabilitiesPLC application programming platformEKE-Trainnet® Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSmartVision™Track Condition MonitoringTrain Condition MonitoringServices and supportCustomer careProject managementReferencesCareerContactCompanyNews and eventsDownloads Search Search"
            },
            {
                "page_url": "https://www.eke-electronics.com/products-and-solutions/eke-trainnet/",
                "content": "Skip to contentCompanyNews and eventsDownloadCompanyNews and eventsDownload Search Products and solutionsEKE-TRAINNET TRAIN CONTROL AND MANAGEMENT SYSTEMS (TCMS)Vehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformVehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformEKE-TRAINNET SAFETY APPLICATIONSAutomatic Selective Door OperationHot Axle Box DetectionCorrect Side Door EnablingLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsAutomatic Selective Door OperationHot Axle Box DetectionCorrect Side Door EnablingLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSMARTVISION CONDITION BASED MONITORING (CBM)Track Condition MonitoringTrain Condition MonitoringTrack Condition MonitoringTrain Condition MonitoringServices and supportCustomer careproject managementReferencesCareerContact EKE-Trainnet®All the products are part of the EKE-Trainnet family and use the same modular platform for maximum freedom and synergy. With the EKE-Trainnet product platform, you keep full control, maximise performance, and minimise hardware, software and footprint while saving money. At the same time reliability increases while maintenance and stock reduce.Home | Products and solutions | EKE-Trainnet®EKE-Trainnet Train Control and Management Systems (TCMS)Modern trains are equipped with an increasing number of intelligent sub-systems to cope with the demands for improved performance, safety, energy efficiency, and comfort. This evolution brings several challenges to train manufacturers, operators, and system integrators such as a lack of interoperability and integration between the different sub-systems which leads to complicated system architecture and various technical challenges. EKE-Trainnet provides tailored solutions for system integration, train automation, train communications, and improved safety. We have solutions for high-speed trains, commuter trains, metros, trams, passenger coaches, and locomotives. Download EKE-Trainnet brochure System integrationIntegrate on-board systems via an efficient and versatile Train Communication network (TCN). Hy­brid networks are also supported.Train AutomationAutomate train operations and diagnostics by developing a powerful Train Control and Management System (TCMS).Onboard CommunicationCommunicate with passengers and staff in the train and beyond via displays, audio announcements and wireless technologies.Improved safetyImprove safety with our SIL technology, redundancies and safety enhancing systems such as Event Recorders and video surveillance. Vehicle Control Unit (VCU) EKE-Trainnet Vehicle Control Unit (VCU) is a powerful and modular computer for train automation and advanced control and diagnostic functions. The VCU can control and automate any train sub-systems. It can be used for both physical control and diagnostics of train sub-systems. The modularity of the hardware allows for tailored systems matching the customer needs perfectly and cost-efficiently, providing also easy upgradeability with new modules as needs arise. Gateways EKE-Trainnet Train Communication Network (TCN) Gateways are advanced and modular train computers used in the creation of efficient Train Communication Networks (TCN). The modularity of the TCN Gateways enables a precise selection of the required train bus and vehicle bus technologies for each individual configuration. Modules can be freely combined for a very flexible and versatile solution. The modular design of EKE-Trainnet® TCN Gateways offers cost-efficiency and quick and easy repairs and upgrade. Remote I/O Module (RIOM) EKE-Trainnet® Remote Input Output Modules (RIOM) provide data input and output to the consistent network within the vicinity of the I/O sources. The EKE-Trainnet® RIOM is an alternative to connecting the input and output sources directly to the train computer, for example, the vehicle control unit (VCU), thus, leading to reduced cabling and cost savings. Ethernet Switches As a pioneer of Ethernet based Train Communication Networks (TCN) EKE has developed Ethernet switching modules that can provide the functions for Ethernet Train Backbone (ETB), Ethernet Consist Network (ECN), Ethernet Switch, ETB Router, and Power-over-Ethernet (PoE). Event Recorders EKE-Trainnet Event Recorders (ER) are on-board data recorders for collecting and storing vital train-borne information. The EKE-Trainnet® ER products offer a wide range of sizes and levels of protections from basic Event Recorders to Rugged Memory Modules (RMM) and to Juridical Recording Units (JRU). Human Machine Interfaces The EKE-Trainnet Human Machine Interfaces (HMI) are robust and easy to use interactive flat display products. They can be used as train driver’s displays; crew’s interactive information displays as well as CCTV monitors. Software (Codesys) EKE-Trainnet utilises CODESYS® Software that is designed for efficient programming of PLC applications of EKE-Trainnet solutions. CODESYS® is also used for simulation, commissioning and debugging. It complies with the IEC 61131 standard. Solution Delivery Capabilities Project Engineering delivers project specific solutions operating on EKE's proven system platform. The project framework contains processes to manage the full lifecycle of the solution from early specifications to support and end-of-life replacement. Cyber Security At EKE-Electronics we have a strong focus on cyber security. We strive to follow the information security requirements on ISO 27001.New products are developed to full SL2 compliance as per IEC 62443.We provide a security gateway device to separate the mission critical network from non-mission critical networks and to analyse the traffic to detect any anomalies (attacks).It is easy to contact EKE Service and Support!EKE’s technical experts are at your service: Fill in the form Call Email Download EKE brochure for more information Contact us Smarter trains. Better future. Contact us Linkedin-in Youtube Privacy Policy | Cookie Policy | Disclaimer | Imprint | Hosting by Sivustamo Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage Cookie Consent Parhaan kokemuksen tarjoamiseksi käytämme teknologioita, kuten evästeitä, tallentaaksemme ja/tai käyttääksemme laitetietoja. Näiden tekniikoiden hyväksyminen antaa meille mahdollisuuden käsitellä tietoja, kuten selauskäyttäytymistä tai yksilöllisiä tunnuksia tällä sivustolla. Suostumuksen jättäminen tai peruuttaminen voi vaikuttaa haitallisesti tiettyihin ominaisuuksiin ja toimintoihin. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage consentManage consent Search Search Products and solutionsEKE-Trainnet® Train Control and Management Systems (TMCS)Vehicle Control UnitTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesSolution Delivery CapabilitiesPLC application programming platformEKE-Trainnet® Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSmartVision™Track Condition MonitoringTrain Condition MonitoringServices and supportCustomer careProject managementReferencesCareerContactCompanyNews and eventsDownloads Search Search"
            },
            {
                "page_url": "https://www.eke-electronics.com/products-and-solutions/eke-trainnet/vehicle-control-unit-vcu/",
                "content": "Skip to contentCompanyNews and eventsDownloadCompanyNews and eventsDownload Search Products and solutionsEKE-TRAINNET TRAIN CONTROL AND MANAGEMENT SYSTEMS (TCMS)Vehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformVehicle Control UnitsTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesPLC application programming platformEKE-TRAINNET SAFETY APPLICATIONSAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringPhysical Prevention of Over-SpeedingVigilance Control SystemAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringPhysical Prevention of Over-SpeedingVigilance Control SystemAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSMARTVISION CONDITION BASED MONITORING (CBM)Track Condition MonitoringTrain Condition MonitoringTrack Condition MonitoringTrain Condition MonitoringServices and supportCustomer careproject managementReferencesCareerContact Vehicle Control UnitHome | Products and solutions | EKE-Trainnet® | Vehicle Control UnitFunctions of Vehicle Control UnitEKE-Trainnet Vehicle Control Unit (VCU) is a powerful computer for train automation. The VCU can carry out advanced control and diagnostic functions. The EKE-Trainnet VCU can control any train sub-system such as brakes or doors. It can be used for both physical control (e.g. opening/closing/locking the doors, activating heating/cooling/ventilation etc.) and diagnostics (e.g. checking the proper closing of a door, monitoring brake temperature etc.) of train sub-systems. EKE-Trainnet enables these control and diagnostic applications to run on the same train computers that are used for Gateway functionalities, providing a more compact and cost-effective solution. Physically separated Gateways can also be implemented. Key features of Vehicle Control UnitThe EKE-Trainnet VCU can connect with sub-systems and the Train Communication Network. Available interfaces include a wide range of bus technologies (e.g. WTB, MVB, CAN, Serial Links and Ethernet) and Input/Output Interface Modules (Analogue Input, High Speed Analogue Input, Digital Input/Output, Digital Relay Output, Analogue Output, Pt-100/PT-1000/NTC Temperature Sensor Input). Remote Input/Output Modules (RIOM) are also available.Typical applications for the Vehicle Control Unit include: Diagnostics PIS/PA system management Crew HMIs management Brakes and traction monitoring SIL and Safety Applications Fleet Management HVAC management Door management Lighting management CCTV system management Tank level monitoring Battery charge monitoring Train-to-wayside communication managementMore ControlThe EKE-Trainnet VCU is a powerful and highly flexible system built on an open-source software platform (Linux). You are free to develop your own applications as well as to integrate third-party Hardware and Software onto the Trainnet® platform. With EKE-Trainnet, you can develop your own applications using the CODESYS PLC Software. You can also develop applications and make configuration modifications in C language, giving you full control. EKE has the expertise to develop all or a part of the Software for you, or alternatively provide training, tools and guidance to support your own developments. Finally, EKE can grant you the intellectual property rights (IPR) of the application Software in order to ensure you a safe, long-term investment.On the Hardware side, the EKE-Trainnet VCU is modular. This means you can develop tailored systems matching your needs perfectly. By simply selecting the interfaces you need, you make sure the system answers all your demands while being cost-efficient. Systems can be easily upgraded with additional modules as needs arise.Download the EKE brochure for more information about the VCU Contact us Smarter trains. Better future. Contact us Linkedin-in Youtube Privacy Policy | Cookie Policy | Disclaimer | Imprint | Hosting by Sivustamo Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage Cookie Consent Parhaan kokemuksen tarjoamiseksi käytämme teknologioita, kuten evästeitä, tallentaaksemme ja/tai käyttääksemme laitetietoja. Näiden tekniikoiden hyväksyminen antaa meille mahdollisuuden käsitellä tietoja, kuten selauskäyttäytymistä tai yksilöllisiä tunnuksia tällä sivustolla. Suostumuksen jättäminen tai peruuttaminen voi vaikuttaa haitallisesti tiettyihin ominaisuuksiin ja toimintoihin. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title}Manage consentManage consent Search Search Products and solutionsEKE-Trainnet® Train Control and Management Systems (TMCS)Vehicle Control UnitTrain Communication Network GatewaysRemote Input/Output ModuleEthernet SwitchesEvent RecordersHuman Machine InterfacesSolution Delivery CapabilitiesPLC application programming platformEKE-Trainnet® Safety ApplicationsAutomatic Selective Door OperationCorrect Side Door EnablingHot Axle Box DetectionLateral Accelaration MonitoringVigilance Control SystemPhysical Prevention of Over-SpeedingAutomated Pantograph ControlOther EKE-Trainnet Safety ApplicationsSmartVision™Track Condition MonitoringTrain Condition MonitoringServices and supportCustomer careProject managementReferencesCareerContactCompanyNews and eventsDownloads Search Search"
            }
        ]
    }
}