{
    "Oy Lival Ab": {
        "url": "http://www.lival.com",
        "mainBusinessLine": "Manufacture of electric lighting equipment",
        "pages": [
            {
                "page_url": "http://www.lival.com",
                "content": "Skip to content Lival Frontpage Products Downloads Our story Our partners What’s New Contact The future of lighting is made in Finland Watch full video A Story of light from the north Lival is all about innovative engineering, sustainability and design. Lival sets the standard in manufacturing durable products. Lival is lighting the way. Get to know us Products Discover our range of quality luminaires for all indoor lighting applications. Product page References Our products are a perfect fit for all indoor uses, from stores and restaurants to offices. See various applications from all around the world. Lival lival@lival.comShow all contacts > Search: Search",
                "status": "success"
            }
        ]
    },
    "Neonteos Oy": {
        "url": "http://www.brandlux.fi",
        "mainBusinessLine": "Manufacture of electric lighting equipment",
        "pages": [
            {
                "page_url": "http://www.brandlux.fi",
                "content": null,
                "status": "failed"
            }
        ]
    },
    "Valomainos Oy": {
        "url": "http://www.valomainos.fi",
        "mainBusinessLine": "Manufacture of electric lighting equipment",
        "pages": [
            {
                "page_url": "http://www.valomainos.fi",
                "content": "Siirry sisältöön LAATUVALMISTAJA Menu Valomainos Oy Meistä Tuotteet ja palvelut Toteutuksia Yhteystiedot Johdattaa asiakkaan perille Ota yhteyttä Johdattaa asiakkaan perille Ota yhteyttä Johdattaa asiakkaan perille Ota yhteyttä Valomainos Oy Laadukkaat valomainokset jo vuodesta 1962. Olemme suomalainen perheyritys, joka on erikoistunut valomainosten valmistukseen. Valomainonta kiinnittää asiakkaasi huomion ja antaa arvokkaan ensivaikutelman. Valomainos johdattaa asiakkaasi perille ja nostaa yrityksesi imagon uudelle tasolle! Laaja valikoima valomainoksia Valikoimamme kattaa kaiken irtokirjainvalomainoksista ja kotelovalomainoksista neonvalomainoksiin ja somisteneoneihin. Valmistamme valomainostaulut ja mainosvalot sisä- ja ulkokäyttöön. Lisäksi valmistamme valaistuja kylttejä, opasteita, liikepaikkapylväitä, mainostorneja ja mainospyloneita. Tarjoamme myös räätälöityjä kokonaisratkaisuja huoltoasemille ja myymälöihin. Lue lisää palveluistamme Tuotteet ja palvelut Lue lisää Toteutuksia Katso täältä! Yhteystiedot Ota yhteyttä! Valovoimaista mainontaa jo vuodesta 1962 Kaikki tuotteemme valmistetaan alusta loppuun omalla tehtaallamme Nurmijärvellä Klaukkalassa. Käytämme tuotannossamme ainoastaan alan uusinta teknologiaa, ja tuotteemme täyttävät tiukat eurooppalaiset standardit. Jokainen valomainoksemme on CE-merkitty, mikä takaa niiden turvallisuuden ja laadun. Katso toteutuksiamme. Valomainokset alusta loppuun: suunnittelu, asennus ja huolto Emme ainoastaan valmista valomainoksia, vaan tarjoamme asiakkaillemme myös suunnittelu-, asennus- ja huoltopalveluita. Lisäksi teemme metallilevyjen laserleikkauksia. Asiantuntijamme varmistavat, että saat juuri sellaisen valomainoksen, joka parhaiten palvelee yrityksesi tarpeita. Ota yhteyttä tänään ja aloitetaan yhteistyö. Lue lisää meistä Teemme alihankintana laserleikkaukset ammattitaitoisesti. Nopeat toimitukset. Kysy lisää Turvallisin Nopein Luotettavin Valomainos Oy | Metsäkyläntie 3, 01800 Klaukkala | Puh. 09 8789 830 | valomainos@valomainos.fi Evästeseloste Ostolaskut sähköpostilla valomainos@valomainos.fi Rekisteriseloste",
                "status": "success"
            }
        ]
    },
    "Karlux Oy": {
        "url": "http://www.karlux.fi",
        "mainBusinessLine": "Manufacture of electric lighting equipment",
        "pages": [
            {
                "page_url": "http://www.karlux.fi",
                "content": "Skip to content MENUMENU TuotteetYritysReferenssitYhteys Infra Kotimaisena valmistajana olemme erikoistuneet yhteistyöhön kaupunkien kanssa. Yhdessä asiakkaan kanssa suunnittelemme ja toteutamme kohteeseen räätälöidyt valaisimet, […] Lue lisää Projektit Saman katon alla oleva suunnittelu ja metalliyrityksen konekanta mahdollistavat joustavan projektityöskentelyn. Toteutamme suunnittelijan tai arkkitehdin suunnittelemat valaisimet […] Lue lisää Pihavalaistus Tiesitkö, että ensimmäinen valaisimemme, KÄPY, on yhä tuotannossa yli 30 vuoden jälkeen? Pihavalaisinmallistomme on kasvanut kattamaan […] Lue lisää VIIMEISTELTYÄ LAATUA Tavoitteena on ollut kehittää valaisintuotteita, jotka rasittavat mahdollisimman vähän luonnon tasapainoa, ottamalla huomioon raaka-aineiden kestävyyden ja kierrätettävyyden. Valaisinmuotoilumme lähtökohtana on luoda iloa silmälle unohtamatta toimivuutta. Tutustu valikoimaamme Ota yhteyttä Nimi (pakollinen) Puhelin (pakollinen) Sähköposti (pakollinen) Aihe Viesti Sulje lomake Esite Selaa helposti esitteitämme online-muodossa. Esitteestä löydät kaikki tuotteemme kätevästi yhdessä paketissa. Lue lisää Moderni LED-teknologia vanhaa kunnioittaen – Forssan kaupungintalon toimistohuoneiden valaistus uudistui Forssan kaupungintalo valmistui vuonna 1977. Rakennuksen sisustus ja henki huokuvat vahvasti 1970-lukua, ja sen ainutlaatuista tunnelmaa […] Lue lisää #karluxoy Seuraa Instagramissa Seuraa Instagramissa Mistä löydät meidät: Karlux Oy, 0535364-9 Paassillantie 1, 15880 Hollola info@karlux.fi Karlux numeroina 40 vuotta kokemusta valaisinvalmistuksesta 11 PK-yritystä alihankinnassa Lahden talousalueelta 41 valaisinta valmistuu päivässä 4058 ruuvia ruuvataan viikossa 12 kenkää tallaa päivittäin tehtaan lattiaa 273 kahvikupillista hörpitään kuukaudessa Esitteet: Led -esite LED-Esitteestä löydät kaikki LED-moduulituotteemme, sekä lisäksi taajamavalaisimista LED E27 mallit. Koko valikoima Pitkästä esitteestä löydät kaikki tuotteemme, niin LED-mallit kuin monimetalliversiot. TAKUUEHDOT LÖYDÄT TÄÄLTÄ Ota yhteyttä X Ota meihin yhteyttä! Voit ottaa meihin yhteyttä alla olevalla lomakkeella. Nimi (pakollinen) Puhelin (pakollinen) Sähköposti (pakollinen) Aihe Viesti",
                "status": "success"
            }
        ]
    },
    "Tekmala Oy": {
        "url": "http://www.tekmala.fi",
        "mainBusinessLine": "Manufacture of electric lighting equipment",
        "pages": [
            {
                "page_url": "http://www.tekmala.fi",
                "content": "Tekmala OySuomalaista sairaalatekniikkaa Etusivu Yritys Tuotteet Valaisimet Tutkimusvalaisimet Toimenpidevalaisimet Yleisvalaisimet Vuodevalaisimet Suurennuslasivalaisimet Leikkausvalaisimet Yövalaisimet Lisävarusteet Kattokeskukset Potilaspaneelit Tesal-4LED Tesal-5LED Tetra-11LED Psykiatrian potilassänky Leikkauspöydät Sairaalakalusteet Sängyt ja tutkimuspöydät Yöpöydät Hoivatuolit Parflex sermijärjestelmä Teollisuusvalaisimet Ajankohtaista Yhteystiedot Ota yhteyttä Etusivu Tekmala Oy on vuonna 1986 perustettu perheyritys, joka toimii laadukkaiden sairaalavalaisimien ja potilaspaneeleiden valmistajana. Tekmala on suunnitellut, valmistanut ja markkinoinut sairaalateknisiä tuotteita suomalaisiin sairaaloihin, terveyskeskuksiin ja muihin julkisiin tiloihin jo yli 30 vuoden ajan. Tekmalan toimintaa ohjaavat korkeatasoinen laatu, muotoilu ja suomalaisuus. Tekmalalle tärkeitä arvoja ovat tyytyväiset asiakkaat ja hyvä palvelu, henkilöstön ammattitaito ja toiminnan tuloksellisuus. Tekmalan mallisto kattaa lähes kaikki sairaalatilat leikkaussaleista vuodeosastojen potilashuoneisiin. Tekmala edustaa Suomessa myös useita eurooppalaisia valmistajia, joiden tuotteistoihin kuuluvat mm. tutkimus-, toimenpide- ja leikkausvalaisimet, kattokeskukset, leikkauspöydät, sairaalakalusteet sekä teollisuusvalaisimet. Ajankohtaista Uudet potilaspaneelit AIS, AURA sekä N270 22.4.2024 Parflex sermijärjestelmä 14.3.2023 Mauro hoivatuoli nousu-, ja istumisavustuksella 10.3.2023 Mauro kuljetus- ja hoivatuoli 28.10.2022 Mauro Ergo-line lepotuoli 10.5.2022 Sairaalakalusteet Potilaspaneelit Leikkauspöydät Valaisimet Kattokeskukset Teollisuusvalaisimet Yhteystiedot Tekmala Oy Veikkointie 22 03100 NUMMELA Puhelin 0207 924 200 Sähköposti info@tekmala.fi Etusivu Yritys Tuotteet Ajankohtaista Ota yhteyttä Yhteystiedot ·Toteutus ja ylläpito MMD Networks·",
                "status": "success"
            }
        ]
    },
    "Atexor Oy": {
        "url": "http://www.atexor.com",
        "mainBusinessLine": "Manufacture of electric lighting equipment",
        "pages": [
            {
                "page_url": "http://www.atexor.com",
                "content": "Navigation Close Ex-Lighting Solutions Ex-Lighting Products Blogs, News & Videos Company Knowledge base Contact us Atexor Downloads Atexor UK Find a Distributor Contact us Ex-Lighting Technology LeadersAtexor's team specializes in designing and manufacturing IECEx, ATEX and UKEX lighting for Explosion Hazardous Areas. In addition to ready-made products, we create custom designed solutions to meet specific customer requirements. Recognized around the world for our quality and reliability, all Atexor products and solutions are designed and manufactured in Finland. Ex-Lighting Solutions ATEX EUROFINS KOSHA NEPSI TÜV RHEINLAND EAC IECEx TIIS Ex CE 0537 CML UKEX NSN Atexor provides ATEX and IECEx certified lighting solutions for Ex Zones, as well as UKCA, KOSHA, NEPSI, DNV and other relevant product certifications. Ex-Expertise at Your ServiceWith over 40 years' experience creating lighting solutions for Explosion Hazard Areas, Atexor is a partner you can rely on. We are part of Teknopower Group, an expert in demanding lighting systems with partners operating in more than 30 countries. About us Meet the Team Get to know our team of highly motivated experts. We have decades of Ex-lighting experience and are ready to serve you. Read more Light Planning Our experienced specialists can create the optimal lighting plan for your Ex area. Read more Case Studies Learn about how the Atexor Ex-Lighting Solutions Team has worked hand-in-hand with customers to deliver bespoke Ex-lighting solutions. Read more Ex-Lighting ProductsIn addition to bespoke solutions, Atexor offers a range of ATEX and IECEx certified products, including SLAM® portable luminaires, SLAM FIXED® lighting, MICA® hand lamps, cables, fittings, and more. Find a product Handlamps Temporary luminaires Fixed luminaires Learn About Ex-LightingDifferent terminology for explosion protected or explosion proof lighting is sometimes used in different markets. However, Atexor can ensure that the lightings solutions we provide meet all safety requirements, wherever you are located. So whether you are looking for Ex-proof lights, Ex rated lights, explosion protected lights, explosion proof luminaires, hazardous area lighting, intrinsically safe LED lamps, or ATEX approved lighting, we can deliver what you need. Knowledgebase Blog & News Atexor Knowledge Base Posted on 21/11/2024 by Team Atexor Our team member Tarmo would like to remind you about the Atexor Knowledge Base we created for you. ... Read more SLAM FIXED® Novo product family and its special advantages Posted on 16/05/2024 by Team Atexor Introducing the new Novo Ex Area lighting product family. The advantages offered by the new structure and why installing Novos is so quick and easy. ... Read more Helsinki Particle Accelerator and MICA® EM Handlamps Posted on 6/11/2023 Important science is taking place at the University of Helsinki Particle Accelerator Laboratory. To ensure their work continues when the lights go out, they turned to Atexor for backup lighting using MICA® EM handlamps. ... Read more Blog & news Social media Our factory in Seinajoki will be closed in the week of 31/2024 for the traditional summer break.... Read more Another informative video from Team Atexor and our own Tuomas. Enjoy!... Read more Ready for orders: SLAM FIXED® Novo 1LED & 2LED! Take a break and check out the product video on our... Read more NOTICE: Atexor Summer Break and our factory closed for one week. Our factory in Seinäjoki is closed during the week... Read more A lovely Finnish summer day offered us great conditions for a Fatbike excursion in nature.... Read more Hyvää Itsenäisyyspäivää, Suomi! 💙 Happy Independence Day, Finland! 🤍. 105 years and counting! The anniversary of Finland’s independence is a... Read more Welcome meet the Atexor team and our brand new SLAM® Neos Ex lighting range at our official UK launch at... Read more The MICA® IL-640 / IL-6400 now features an upgraded circuit board for improved power delivery and management to the latest... Read more Contact usOur team is ready to help solve your Ex-lighting needs! Contact us Atexor - Ex-Lighting Technology Leaders ATEXOR OY Switchboad +358 20 734 3250 Headquarters Suomalaistentie 7 FI-02270 Espoo, Finland Manufacturing Puurtajantie 16 FI-60100 Seinäjoki, Finland Subscribe to our newsletter Subscribe Follow us on Social media Ex-Lighting Solutions Ex-Lighting Products MICA® SLAM® SLAM FIXED® Knowledge base Blogs, News & Videos Company Team Training Atexor Downloads Contact us Find a distributor Atexor UK © Atexor 2024 • Privacy notice • Cookie policy WE ARE EXPANDING OUR PARTNER NETWORK Help meet the growing demand for quality ATEX and IECEx No Yes",
                "status": "success"
            }
        ]
    },
    "Junnu Neon Oy": {
        "url": "http://www.junnuneon.fi",
        "mainBusinessLine": "Manufacture of electric lighting equipment",
        "pages": [
            {
                "page_url": "http://www.junnuneon.fi",
                "content": "Etusivu Teippaukset Autoteippaukset Ikkunateippaukset aurinkosuojakalvot Valomainokset Led-valomainokset Valomainos huolto Myymälämainonta Suunnittelupalvelu Mainostekstiilit Referenssit Yhteystiedot Valitse sivu Loistavaa mainonnan tuotantoa yrityksille vuodesta 1994 Valomainosten myynnistä, suunnittelusta, asennuksesta ja huollosta on meillä kokemusta, jo kolmannessa sukupolvessa.Olemme toimittaneet luottamuksella valomainoksia, ikkunateippauksia sekä opasteita, niin isoille kuin pienille yrityksille, ympäri Suomea sekä Baltian maihin ja Venäjälle. Pyydä tarjous Valomainokset teippaukset Mainostekstiilit Miksi valita meidät kumppaniksi? Kaiken toimintamme perustana on luotettavuus, ammattitaito ja toimitusvarmuus. Tästä syystä asiakasuskollisuutemme on erittäin korkeaa luokkaa. Emme vain myy ja asenna mainostuotteita, vaan hoidamme myös niiden huoltamisen. Näiden lisäksi saat meiltä kattavat palvelut mainontaan ja markkinointiin suunnittelusta täydellisiin toimituksiin. Pyydä tarjous Asiakkaitamme: Valomainokset Valomainokset ovat pitkäikäinen investointi. Valomainosten odotetaan säilyvän hyvässä kunnossa sekä uudenveroisena vuosia, siksi valomainosten laatu on tärkeä toimituksissa. Junnu Neon Oy valmistaa ja asentaa itse valomainokset kaikkialle Suomeen ja Baltian alueille Pitkä kokemuksemme mainosalalla takaa jatkuvan kehittymisen sekä laajenemisen ideoiden toteutukseen sekä asiakkaiden tyytyväisyyteen. Pyydä tarjous Lue lisää Teippaukset Mainosteippaukset ovat mainio tapa mainostaa yritystä. Teippauksella saat mainospinta-alaa ja näkyvyyttä yrityksellesi aina siellä missä väkijoukot liikkuvat. Autojen lisäksi teippaamme mm. veneitä, rekka-autoja, moottoripyöriä ja linja-autoja. Periaattessa teippaamme mitä vain, mihin teippi tarttuu. Autoteippaukset Teippaamme kaikenlaiset autot yrityksille ja kunta- ja kaupunkisektorin toimijoille. Ikkunateippaus Ikkunateippaus erilaisiin kohteisiin Auringonsuojakalvot Aurinkosuojakalvot ja tummennuskalvot autoihin ja ikkunoihin Pyydä tarjous Lue lisää Mainostekstiilit Mainostekstiileillä saatte yrityksen työntekijöille yhtenäisen ilmeen. Logolla tai mainoksilla painetut t-paidat ja lippikset tekevät ammattimaisen vaikutuksen Pyydä tarjous Lue lisää Vauhdilla asiaan! Kysy meiltä yrityksesi mainostusratkaisuihin liittyvistä asioista. Palvelemme mielellämme GSM – 0400 611 616 Kysy lisää Mitä asiakkaat sanovat meistä Huippu palvelu. Ammattitaitoiset teippaajat ja tosi mukava meininki. Vahva suositus! Mika Lahtinen Tarkkaa työtä ja silma lepää. Rami Kankkunen Käytettävät materiaalit huippuluokkaa. Neuvonta ja opastus, ennen tilausta erittäin osaavaa ja ammattitaitoista Tomi Hänninen Kysy tarjous Yrityksen / organisaation nimi* Sähköposti* PuhelinKerro mistä tuotteista haluaisit saada tarjouksen*CAPTCHA KOTISIVUJEN SUUNNITTELU / FORTAMEDIA.FI Facebook X RSS Junnu Neon Oy, Mestarintie 27 7, 06150 Porvoo. 040 061 1616",
                "status": "success"
            }
        ]
    },
    "ARTEQUA Oy": {
        "url": "http://WWW.ARTEQUA.COM",
        "mainBusinessLine": "Manufacture of electric lighting equipment",
        "pages": [
            {
                "page_url": "http://WWW.ARTEQUA.COM",
                "content": "Tuotteet Yhteystiedot Referenssit EN ARTEQUA OY - Finlaysoninkuja 13, 33210 Tampere Artequa Led-valaisimien valmistus ja myynti Tuotteet Ecovalo kiinteistovalaisimet – Ecovalo RU katto(upotettava) – Ecovalo R seinä/katto – Ecovalo BALK BR seinä/katto Ecovalo KP pylväsvalaisin Ecovalo pylväsvalaisimet – Ecovalo BALK-K pylväsvalaisimet – Ecovalo KE20…KE30LE pylväsvalaisimet – Ecovalo KE40…KE50C pylväsvalaisimet – Ecovalo KE20-V…KE30LE-V pylväsvalaisimet – Ecovalo KE40-V…KE50C-V pylväsvalaisimet – Ecovalo K40-P…K50LE-P pylväsvalaisimet – Ecovalo K60-P…K80LE-P pylväsvalaisimet – Ecovalo R100LE-O ja R100SS valonheittimet Yhteystiedot Referenssit Yritys EN TuotteetEcovalo kiinteistovalaisimet– Ecovalo RU katto(upotettava) – Ecovalo R seinä/katto – Ecovalo BALK BR seinä/katto Ecovalo KP pylväsvalaisin Ecovalo pylväsvalaisimet– Ecovalo BALK-K pylväsvalaisimet – Ecovalo KE20…KE30LE pylväsvalaisimet – Ecovalo KE40…KE50C pylväsvalaisimet – Ecovalo KE20-V…KE30LE-V pylväsvalaisimet – Ecovalo KE40-V…KE50C-V pylväsvalaisimet – Ecovalo K40-P…K50LE-P pylväsvalaisimet – Ecovalo K60-P…K80LE-P pylväsvalaisimet – Ecovalo R100LE-O ja R100SS valonheittimet Yhteystiedot Referenssit Yritys EN TEHOKASTA VALAISTUSTA TYYLILLÄ TEHOKASTA VALAISTUSTA TYYLILLÄ TEHOKASTA VALAISTUSTA TYYLILLÄ Tuotteet Ecovalo kiinteistövalaisimet, useita tuoteperheitä Ecovalo KP puistovalaisin Ecovalo pylväsvalaisimet, useita tuoteperheitä Myynti ja markkinointi Mauri Drufva Puh 050 3278 061 mauri.drufva@artequa.com ARTEQUA OY Finlaysoninkuja 13 33210 Tampere Copyright 2019 Artequa Oy Tuotanto ja suunnittelu ARTEQUA OY Puh 03 3640 021 artequa@artequa.com Jaakontie 2 C 39200 Kyröskoski © Copyright 2024 Artequa - Led Lighting",
                "status": "success"
            }
        ]
    }
}